; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	thermograph0 - mode
	image1 - mode
	image2 - mode
	infrared3 - mode
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star6 - direction
	Star5 - direction
	GroundStation4 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 image1)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 infrared3)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument5 image2)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
	(supports instrument6 image1)
	(supports instrument6 image2)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 infrared3)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star5)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon9)
	(supports instrument8 image2)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation4)
	(calibration_target instrument8 Star5)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star6)
)
(:goal (and
	(pointing satellite2 Star5)
	(pointing satellite3 GroundStation0)
	(pointing satellite4 Planet12)
	(have_image Phenomenon7 image1)
	(have_image Planet8 thermograph0)
	(have_image Phenomenon9 infrared3)
	(have_image Planet10 image1)
	(have_image Planet11 image2)
	(have_image Planet12 image1)
	(have_image Phenomenon13 infrared3)
))

)

; plan
1. (turn_to satellite3 groundstation1 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 groundstation1)
   goals met: 0 of 10
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 10
3. (calibrate satellite3 instrument6 groundstation1)
   added: (calibrated instrument6)
   goals met: 0 of 10
4. (turn_to satellite3 planet11 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet11)
   goals met: 0 of 10
5. (take_image satellite3 planet11 instrument6 image2)
   added: (have_image planet11 image2)
   goals met: 1 of 10
6. (turn_to satellite3 planet10 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 planet10)
   goals met: 1 of 10
7. (take_image satellite3 planet10 instrument6 image1)
   added: (have_image planet10 image1)
   goals met: 2 of 10
8. (turn_to satellite3 phenomenon7 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon7)
   goals met: 2 of 10
9. (turn_to satellite2 star5 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star5)
   goals met: 3 of 10
10. (turn_to satellite0 star5 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star5)
   goals met: 3 of 10
11. (take_image satellite3 phenomenon7 instrument6 image1)
   added: (have_image phenomenon7 image1)
   goals met: 4 of 10
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 10
13. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 4 of 10
14. (turn_to satellite0 phenomenon13 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 10
15. (take_image satellite0 phenomenon13 instrument1 infrared3)
   added: (have_image phenomenon13 infrared3)
   goals met: 5 of 10
16. (turn_to satellite0 phenomenon9 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 10
17. (take_image satellite0 phenomenon9 instrument1 infrared3)
   added: (have_image phenomenon9 infrared3)
   goals met: 6 of 10
18. (turn_to satellite3 planet12 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 planet12)
   goals met: 6 of 10
19. (take_image satellite3 planet12 instrument6 image1)
   added: (have_image planet12 image1)
   goals met: 7 of 10
20. (turn_to satellite3 planet8 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 planet8)
   goals met: 7 of 10
21. (take_image satellite3 planet8 instrument6 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 8 of 10
22. (turn_to satellite3 groundstation0 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 groundstation0)
   goals met: 9 of 10
23. (turn_to satellite4 planet12 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 planet12)
   goals met: 10 of 10
